import 'package:flutter/material.dart';



//base url of api
const BASE_URL = "https://demo.fieldx.maacinfo.com/api/";

//route name
const MAIN_PAGE = "/main_page";
const HOME_PAGE = "/home_page";
const LOGIN_PAGE = "/login_page";
const REGISTER_PAGE = "/register_page";
const FORGET_PASSWORD_PAGE = "/forget_passeord_page";




const text = "স্কুল থেকে কলেজ ছাত্রলীগের নেতা। সেখান থেকে জেলা ও কেন্দ্রে। এরপর গাজীপুরের সদর উপজেলার ভাইস চেয়ারম্যান। মাত্র ৩৯ বছর বয়সে গাজীপুর সিটির মেয়র, তিনি জাহাঙ্গীর আলম। নিজ দল ক্ষমতাসীন আওয়ামী লীগ থেকে তাঁর রাজনৈতিক জীবনে প্রথমবারের মতো কারণ দর্শানোর নোটিশ পেলেন। সামাজিক যোগাযোগর মাধ্যমে ছড়ানো এক ভিডিওয়ের রেশ ধরে দলীয় শৃঙ্খলাভঙ্গের অভিযোগে এই ব্যবস্থা। ১৮ অক্টোবরের মধ্যে দিতে হবে জবাব।";
const text2="শীর্ষ ২০ খেলাপি প্রতিষ্ঠানের কাছে জিম্মি রাষ্ট্রীয় মালিকানাধীন সোনালী ব্যাংক। ঋণের অর্থও আদায় হচ্ছে না, আবার অর্থ আদায়ে দৃশ্যমান কোনো ব্যবস্থাও নিতে দেখা যাচ্ছে না। ফলে মন্দ ঋণের বোঝা চেপে বসেছে ব্যাংকটির ঘাড়ে। রাষ্ট্রীয় মালিকানাধীন সোনালী ব্যাংক। ঋণের অর্থও আদায় হচ্ছে না, আবার অর্থ আদায়ে দৃশ্যমান কোনো ব্যবস্থাও  দিনের পর দিন দুর্বল হয়ে পড়ছে আর্থিক প্রতিষ্ঠানটি। শীর্ষ ২০ খেলাপি প্রতিষ্ঠানের কাছে জিম্মি রাষ্ট্রীয় মালিকানাধীন সোনালী ব্যাংক। ঋণের অর্থও আদায় হচ্ছে না, আবার অর্থ আদায়ে দৃশ্যমান কোনো ব্যবস্থাও নিতে দেখা যাচ্ছে না। ফলে মন্দ ঋণের বোঝা চেপে বসেছে ব্যাংকটির ঘাড়ে। দিনের পর দিন দুর্বল হয়ে পড়ছে আর্থিক প্রতিষ্ঠানটি";

